{
  "books": {
    "38683f1e-6b5c-4072-a663-22e98af31713": {
      "title": "What the River Knows",
      "isbn": "9781250803375",
      "author": "Isabel Ibañez",
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674234543i/65213381.jpg",
      "genre": ["Fantasy", "Mystery", "History"],
      "publishYear": "2023",
      "description": "Bolivian-Argentinian Inez Olivera belongs to the glittering upper society of nineteenth century Buenos Aires, and like the rest of the world, the town is steeped in old world magic that’s been largely left behind or forgotten. Inez has everything a girl might want, except for the one thing she yearns the most: her globetrotting parents—who frequently leave her behind.",
      "_id": "38683f1e-6b5c-4072-a663-22e98af31713"
    },
    "f710d761-6a48-4771-ba00-bf5d48e90189": {
      "title": "Huda F Cares?",
      "isbn": "9780593532805",
      "author": "Huda Fahmy",
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685352217i/78292425.jpg",
      "genre": ["Humor and comedy", "Comics"],
      "publishYear": "2023",
      "description": "Huda and her sisters can’t believe it when her parents announce that they’re actually taking a vacation this summer . . . to DISNEY WORLD! But it’s not quite as perfect as it seems. First Huda has to survive a 24-hour road trip from Michigan to Florida, with her sisters annoying her all the way. And then she can’t help but notice the people staring at her and her family when they pray in public. Back home in Dearborn she and her family blend right in because there are so many other Muslim families, but not so much in Florida and along the way. It’s a vacation of forced (but unexpectly successful?) sisterly bonding, a complicated new friendship, a bit more independence, and some mixed feelings about her family’s public prayers. Huda is proud of her religion and who she is, but she still sure wishes she didn’t care so much what other people thought",
      "_id": "f710d761-6a48-4771-ba00-bf5d48e90189"
    },
    "8025cf56-1dd5-454b-a74d-08be94a3cb4d": {
      "title": "Fourth Wing",
      "isbn": "9781649374042",
      "author": "Rebecca Yarros",
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1666994927i/61431922.jpg",
      "genres": ["Fantasy", "Mystery"],
      "publishYear": "2023",
      "description": "Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders. But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.She’ll need every edge her wits can give her just to see the next sunrise. Yet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret. Friends, enemies, lovers. Everyone at Basgiath War College has an agenda—because once you enter, there are only two ways out: graduate or die",
      "_id": "8025cf56-1dd5-454b-a74d-08be94a3cb4d"
    },
    "cfef3517-aca2-4068-b6bd-de914f533c5a": {
      "title": "Elon Musk",
      "isbn": "9781982181284",
      "author": "Walter Isaacson",
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1692288251i/122765395.jpg",
      "genres": ["Fantasy", "Mystery"],
      "publishYear": "2023",
      "description": "When Elon Musk was a kid in South Africa, he was regularly beaten by bullies. One day a group pushed him down some concrete steps and kicked him until his face was a swollen ball of flesh. He was in the hospital for a week. But the physical scars were minor compared to the emotional ones inflicted by his father, an engineer, rogue, and charismatic fantasist. /nHis father’s impact on his psyche would linger. He developed into a tough yet vulnerable man-child, prone to abrupt Jekyll-and-Hyde mood swings, with an exceedingly high tolerance for risk, a craving for drama, an epic sense of mission, and a maniacal intensity that was callous and at times destructive./nAt the beginning of 2022—after a year marked by SpaceX launching thirty-one rockets into orbit, Tesla selling a million cars, and him becoming the richest man on earth—Musk spoke ruefully about his compulsion to stir up dramas. “I need to shift my mindset away from being in crisis mode, which it has been for about fourteen years now, or arguably most of my life,” he said./n It was a wistful comment, not a New Year’s resolution. Even as he said it, he was secretly buying up shares of Twitter, the world’s ultimate playground. Over the years, whenever he was in a dark place, his mind went back to being bullied on the playground. Now he had the chance to own the playground./n For two years, Isaacson shadowed Musk, attended his meetings, walked his factories with him, and spent hours interviewing him, his family, friends, coworkers, and adversaries. The result is the revealing inside story, filled with amazing tales of triumphs and turmoil, that addresses the are the demons that drive Musk also what it takes to drive innovation and progress?",
      "_id": "cfef3517-aca2-4068-b6bd-de914f533c5a",
      "genre": ["History"]
    }
  },
  "comments": [
    {
      "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
      "bookID": "f710d761-6a48-4771-ba00-bf5d48e90189",
      "comment": "Love it!",
      "_createdOn": 1700669985249,
      "_id": "f73221ea-3d37-428a-bb23-a6c9cfe87ca6"
    }
  ],
  "likes": [
    {
      "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
      "userId": "35c62d76-8152-4626-8712-eeb96381bea8",
      "_createdOn": 1700669811560,
      "_id": "314e9a01-06d9-48e8-ba80-90403316641a"
    }
  ]
}
